zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_jh/pic32cm_jh00/atdf/PIC32CM3204JH00032.atdf
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT__WEN">
        <value name="DISABLED" caption="WDT is disabled" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__HYST">
        <value name="DISABLED" caption="No Hysteresis" value="0x0"/>
        <value name="ENABLED" caption="Hysteresis Enabled" value="0x1"/>
      </value-group>
    </module>
    <module name="OSCCTRL" id="U2119" version="2.1.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x800"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x800"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Timeout" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x800"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x4"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x200"/>
          <bitfield name="DPLLTO" caption="DPLL Timeout" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x800"/>
        </register>
        <register name="XOSCCTRL" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="CFDEN" caption="Xosc Clock Failure Detector Enable" mask="0x8"/>
          <bitfield name="SWBEN" caption="Xosc Clock Switch Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="OSCCTRL_XOSCCTRL__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000" values="OSCCTRL_XOSCCTRL__STARTUP"/>
        </register>
        <register name="CFDPRESC" offset="0x12" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Prescaler">
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x7" values="OSCCTRL_CFDPRESC__CFDPRESC"/>
        </register>
